## [RootSpace](http://peterdeme.app.spacelift.tf/stack/rootspace/run/01HHJ093NETFXWSHDJB5RAZ92S) plan logs

<details>
<summary>Click here to expand</summary>

```
[01HHHZXVAMAVSFXDXPGXG75ZCV] Planning changes with 0 custom hooks...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_string.random will be created
  + resource "random_string" "random" {
      + id               = (known after apply)
      + length           = 6
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "/@£$"
      + result           = (known after apply)
      + special          = true
      + upper            = true
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + image_id            = "default"
  + randomstring_result = (known after apply)
[01HHHZXVAMAVSFXDXPGXG75ZCV] Changes are GO
[01HHHZXVAMAVSFXDXPGXG75ZCV] Uploading the list of managed resources...
[01HHHZXVAMAVSFXDXPGXG75ZCV] Please be aware that the run changes calculation includes output changes.
[01HHHZXVAMAVSFXDXPGXG75ZCV] Resource list upload is GO
[01HHHZXVAMAVSFXDXPGXG75ZCV] Generating JSON representation of the plan...
[01HHHZXVAMAVSFXDXPGXG75ZCV] JSON representation is GO
[01HHHZXVAMAVSFXDXPGXG75ZCV] Loading custom plan policy inputs...
[01HHHZXVAMAVSFXDXPGXG75ZCV] 0 custom plan policy inputs found
[01HHHZXVAMAVSFXDXPGXG75ZCV] No plan policies to evaluate
```

</details>